# Script to create html from cities.csv

In [2]:
#Import dependancies
import pandas as pd

In [3]:
city_lat_df= pd.read_csv('cities.csv')

In [4]:
#Visually inspect dataframe
city_lat_df.head(5)

,City_ID,City,Cloudiness,Country,Date,Humidity,Lat,Lng,Max Temp,Wind Speed
0,0,jacareacanga,0,BR,1528902000,62,-6.22,-57.76,89.60,6.93
1,1,kaitangata,100,NZ,1528905304,94,-46.28,169.85,42.61,5.64
2,2,goulburn,20,AU,1528905078,91,-34.75,149.72,44.32,10.11
3,3,lata,76,IN,1528905305,89,30.78,78.62,59.89,0.94
4,4,chokurdakh,0,RU,1528905306,88,70.62,147.90,32.17,2.95

In [5]:
#Check dimensionality of dataframe
city_lat_df.shape

(547, 10)

In [6]:
#Dataframe info
city_lat_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 547 entries, 0 to 546
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City_ID     547 non-null    int64
 1   City        547 non-null    object
 2   Cloudiness  547 non-null    int64
 3   Country     545 non-null    object
 4   Date        547 non-null    int64
 5   Humidity    547 non-null    int64
 6   Lat         547 non-null    float64
 7   Lng         547 non-null    float64
 8   Max Temp    547 non-null    float64
 9   Wind Speed  547 non-null    float64
dtypes: float64(4), int64(4), object(2)
memory usage: 42.9+ KB

In [7]:
#Convert unix timestamp in 'Date' column to datetime for readability
city_lat_df['Date'] = pd.to_datetime(city_lat_df['Date'], unit='s')

In [9]:
#Confirm datetime conversion
city_lat_df.head(5)

,City_ID,City,Cloudiness,Country,Date,Humidity,Lat,Lng,Max Temp,Wind Speed
0,0,jacareacanga,0,BR,2018-06-13 15:00:00,62,-6.22,-57.76,89.60,6.93
1,1,kaitangata,100,NZ,2018-06-13 15:55:04,94,-46.28,169.85,42.61,5.64
2,2,goulburn,20,AU,2018-06-13 15:51:18,91,-34.75,149.72,44.32,10.11
3,3,lata,76,IN,2018-06-13 15:55:05,89,30.78,78.62,59.89,0.94
4,4,chokurdakh,0,RU,2018-06-13 15:55:06,88,70.62,147.90,32.17,2.95

In [10]:
#Write dataframe to html file
city_lat_df.to_html('cities_lat.html', index=False)